---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisBuildingOperatingSchedule
source: html/01a9de26-22cb-039c-2fa0-044ebbc900a0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisBuildingOperatingSchedule Property

"Building Operating Schedule"

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisBuildingOperatingSchedule { get; }
```